package com.kucoin.websocket;

import org.apache.catalina.Context;
import org.apache.catalina.LifecycleException;
import org.apache.catalina.startup.Tomcat;
import org.apache.tomcat.util.descriptor.web.WebXml;
import org.apache.tomcat.websocket.server.WsSci;

import javax.websocket.DeploymentException;
import javax.websocket.server.ServerContainer;
import javax.websocket.server.ServerEndpointConfig;

/**
 * @Author yomi
 * @created at 2024/11/07/11:06
 * @Version 1.0.0
 * @Description 实现一个websocket
 */
public class WebSocketServerApp {
    public static void main(String[] args) throws LifecycleException, DeploymentException {
//        Tomcat tomcat = new Tomcat();
//        tomcat.setPort(8080);
//        tomcat.getConnector();
//        tomcat.addWebapp("/", System.getProperty("java.io.tmpdir"));
//        // Add WebSocket endpoint
//        ServerContainer serverContainer = (ServerContainer) tomcat.getServletContext().getAttribute("javax.websocket.server.ServerContainer");
//
//        try {
//            serverContainer.addEndpoint(ServerEndpointConfig.Builder.create(WebSocketServer.class, "/websocket").build());
//
//        } catch (Exception e) {
//            e.printStackTrace();
//
//        }
//
//        tomcat.start();
//        tomcat.getServer().await();


        //-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//        Tomcat tomcat = new Tomcat();
//        tomcat.setPort(8080);
//        tomcat.getConnector();
//
//        // Add a context
//        String contextPath = "";
//        String docBase = System.getProperty("java.io.tmpdir");
//        Context context = tomcat.addContext(contextPath, docBase);
//
//        // Add WebSocket support
//        context.addServletContainerInitializer(new WsSci(), null);
//        tomcat.start();
//
//        // Get the ServerContainer and add the WebSocket endpoint
//        ServerContainer serverContainer = (ServerContainer) context.getServletContext().getAttribute("javax.websocket.server.ServerContainer");
//        String contextPath1 = context.getServletContext().getContextPath();
//        serverContainer.addEndpoint(ServerEndpointConfig.Builder.create(WebSocketServer.class, "/websocket").build());
//        tomcat.getServer().await();

        //-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

        Tomcat tomcat = new Tomcat();
        tomcat.setPort(8080);

        // 添加Web应用
//        String contextPath = "";
//        String appBase = ".";
//        Context context = tomcat.addWebapp(contextPath, appBase);

        String contextPath = "";
        String docBase = System.getProperty("java.io.tmpdir");
        Context context = tomcat.addContext(contextPath, docBase);

        // 注册WebSocket支持
        context.addApplicationListener(WsSci.class.getName());

        // 启动Tomcat
        tomcat.start();
        tomcat.getServer().await();

    }

    /**
     let socket = new WebSocket("ws://localhost:8080/websocket");
     socket.onopen = function(e) {
     console.log("[open] Connection established");
     socket.send("Hello Server!");
     };
     socket.onmessage = function(event) {
     console.log(`[message] Data received from server: ${event.data}`);
     };
     socket.onclose = function(event) {
     if (event.wasClean) {
     console.log(`[close] Connection closed cleanly, code=${event.code} reason=${event.reason}`);
     } else {
     console.log('[close] Connection died');
     }
     };
     socket.onerror = function(error) {
     console.log(`[error] ${error.message}`);
     };

     */
}
